<?php

namespace App\Conversations;

use Illuminate\Foundation\Inspiring;
use BotMan\BotMan\Messages\Incoming\Answer;
use BotMan\BotMan\Messages\Outgoing\Question;
use BotMan\BotMan\Messages\Outgoing\Actions\Button;
use BotMan\BotMan\Messages\Conversations\Conversation;

class AllTodoConversation extends Conversation
{
    /**
     * First question
     */
   
    public function run()
    {
       
      $this->bot->reply('
      
      การเลือกซื้อสินค้า 
      <br> .................................... 
      <br>1. ค้นหาสินค้าที่ต้องการ
      <br>** คุณสามารถค้นหาสินค้าที่คุณต้องการได้อย่างหลากหลาก ไม่ว่าจะเป็นชื่อสินค้า,หมวดหมู่สินค้าหรือใช้แถบค้นหาสินค้า
      <br>
      <br> >>การค้นหาสินค้า
      <br> 1. กดช่องค้นหา และพิมพ์ชื่อสินค้าที่คุณต้องการ
      <br> 2. กดเลือก สินค้า จากผลการค้นหาที่ขึ้น
      <br> 3. เมื่อเจอสินค้าที่ต้องการ กด “เพิ่มไปยังรถเข็น” เพื่อทำการเลือกขนาด/สี ที่ต้องการ
      <br> 4. หลังจากเลือกรายละเอียดสินค้าเรียบร้อยแล้ว ให้กดที่ปุ่ม “เพิ่มไปยังรถเข็น”
      <br>
      <br> 2. การซื้อ
      <br> ** หลังจากคลิกปุ่ม “ซื้อสินค้า” ผู้ซื้อต้องกรอกจำนวนสินค้าที่ต้องการ และ ต้องเลือกรายละเอียดสินค้าเพิ่มเติม เช่น เลือกสี, ขนาด, จากนั้นคลิกปุ่ม "ซื้อสินค้า" คุณจะไปสู่หน้า รถเข็นสินค้า
      <br>
      <br> 3. รถเข็นสินค้า
      <br>      > เลือก สินค้าที่ต้องการชำระเงิน จากนั้นกด "ชำระเงิน"
      <br>      > เลือกหรือเพิ่ม ที่อยู่ในการจัดส่งสินค้า วิธีการชำระเงิน
      <br>      > เลือก วิธีการชำระเงินที่ต้องการ จากนั้นกด "ยืนยัน" เพื่อทำการชำระเงิน
      <br>      > ตรวจสอบข้อมูลคำสั่งซื้ออีกครั้งเพื่อความถูกต้อง และคลิก สั่งสินค้า
       <br> ....................................
       
       ');

      
    }
}
